function Dsy() {
    this.Items = {};
}
Dsy.prototype.add = function (id, iArray) {
    this.Items[id] = iArray;
}
Dsy.prototype.Exists = function (id) {
    if (typeof(this.Items[id]) == "undefined") return false;
    return true;
}

function change(v) {
    var str = "0";
    for (i = 0; i < v; i++) { str += ("_" + (document.getElementById(s[i]).selectedIndex - 1));}
    ;
    var ss = document.getElementById(s[v]);
    with (ss) {
        length = 0;
        options[0] = new Option(opt0[v], opt0[v]);
        if (v && document.getElementById(s[v - 1]).selectedIndex > 0 || !v) {
            if (dsy.Exists(str)) {
                ar = dsy.Items[str];
                for (i = 0; i < ar.length; i++)options[length] = new Option(ar[i], ar[i]);
                if (v)options[0].selected = true;
            }
        }
        if (++v < s.length) {change(v);}
    }
}
function preselect(p_key) {
    //alert(p_key);
    var index;

    var provinces = new Array("福建省", "江西省", "湖南省", "广东省",  "陕西省");
    var cnt = provinces.length;
    //alert(cnt);
    for (i = 0; i < cnt; i++) {
        if (p_key == provinces[i]) {
            index = i;
            break;
        }
    }
    if (index < provinces.length) {
        document.getElementById(s[0]).selectedIndex = index + 1;
        change(1);
    }
}

var dsy = new Dsy();

dsy.add("0_0_0", ["维达汽车修理厂 地址：福州市晋安区福新东路370号附近","长城汽车修理厂 地址：福州市鼓楼区保福路18号附近","祥和缘汽车修理厂 地址：福州市晋安区远洋路","精盛汽车修理厂	地址：福州市鼓楼区铜盘路附近","宏洋汽车修理厂	地址：福州市鼓楼区保福路","鸿卓汽车修理厂	地址：福州市仓山区洪山桥下"	]);
dsy.add("0_0_1", ["恒利汽车修理厂  地址：莆田市涵江区涵华东路1468号附近","新世纪汽车修理厂 地址：莆田市城厢区荔城路附近"]);
dsy.add("0_0_2", ["一航修理厂 地址：三明市尤溪县解放路附近","丽友汽车修理厂 地址：三明市梅列区梅列大桥附近"]);
dsy.add("0_0_3", ["鼎力修理厂 地址：泉州市晋江市共富路附近","袁航汽车修理厂 地址：泉州市晋江市罗山罗裳工业区","西鉄汽车修理厂 地址：泉州市晋江市泉安南路","好运汽车修理厂 地址：泉州市晋江市罗山罗裳工业区40号"]);
dsy.add("0_0_4", ["藤原汽车修理厂	地址：厦门市思明区洪莲中路","富萍汽车修理厂 地址：厦门市湖里区县后社"]);
dsy.add("0_0_5", ["兆锋汽车修理厂	地址：漳州市东山县西环一路"]);
dsy.add("0_0_6", ["顺达汽车修理厂 地址：龙岩市新罗区登高东路343-10号附近","诚信通汽车修理厂 地址：龙岩市永定县坎市先富路莲花工业园区斜对面"]);
dsy.add("0_0", ["福州市","莆田市", "三明市", "泉州市", "厦门市", "漳州市", "龙岩市"]);

dsy.add("0_1_0", ["众信汽车修理厂 地址：南昌市东湖区紫云路35附近","赛浪元汽车修理厂 地址：南昌市新建县坎七段"]);
dsy.add("0_1_1", ["杨乐修理厂 地址：九江市永修县白莲路","正大发汽车修理厂 地址：九江市浔阳区浔阳东路","南关门汽车修理厂 地址：九江市共青城市发展大道附近","正大发汽车修理厂 地址：九江市浔阳区浔阳东路","南关门汽车修理厂	地址：九江市共青城市发展大道附近"]);
dsy.add("0_1_2", ["鑫龙悦汽车修理厂	地址：景德镇市昌江区岚山路附近","新兴鑫汽车修理厂	地址：景德镇市珠山区马鞍山路","新城市汽车修理厂	地址：景德镇市昌江区瓷都大道","中恒四海汽车修理厂      地址：景德镇市昌江区新风路","鑫龙悦汽车修理厂	地址：景德镇市昌江区岚山路附近","新兴鑫汽车修理厂	地址：景德镇市珠山区马鞍山路","新城市汽车修理厂	地址：景德镇市昌江区瓷都大道路"	,"中恒四海汽车修理厂      地址：景德镇市昌江区新风路"]);
dsy.add("0_1_3", ["衡山汽车修理厂 地址：新余市渝水区青年路附近","衡山汽车修理厂 地址：新余市渝水区青年路附近"]);
dsy.add("0_1_4", ["宏业汽车修理厂 地址：萍乡市安源区登岸西路88号","宏业汽车修理厂 地址：萍乡市安源区登岸西路88号"]);
dsy.add("0_1_5", ["小世界汽车修理厂 地址：赣州市于都县水南村","天驰腾汽车修理厂 地址：赣州市石城县西华中路","宏伟汽车修理厂  地址：赣州市于都县于银大道于都六中附近","东城阳汽车修理厂 地址：赣州市章贡区环城路附近","利达广汽车修理厂 地址：赣州市定南县京九大道附近","小世界汽车修理厂  地址：赣州市于都县水南村","天驰腾汽车修理厂	地址：赣州市石城县西华中路","宏伟汽车修理厂 地址：赣州市于都县于银大道于都六中附近","东城阳汽车修理厂	地址：赣州市章贡区环城路附近","利达广汽车修理厂	地址：赣州市定南县京九大道附近"]);
dsy.add("0_1_6", ["康凯汽车修理厂 地址：抚州市临川区文昌大道附近","康凯汽车修理厂 地址：抚州市临川区文昌大道附近"]);
dsy.add("0_1_7", ["振业修理厂 地址：宜春市铜鼓县城南中路和585乡道的交叉口附近","振业修理厂 地址：宜春市铜鼓县城南中路和585乡道的交叉口附近"]);
dsy.add("0_1_8", ["阳光修理厂 地址：吉安市遂川县井冈山大道附近","阳光修理厂 地址：吉安市遂川县井冈山大道附近"]);
dsy.add("0_1", ["南昌市", "九江市", "景德镇市", "新余市", "萍乡市", "赣州市", "抚州市", "宜春市", "吉安市"]);

dsy.add("0_2_0", ["星星修理厂 地址：长沙市雨花区湘府东路红星商务楼1栋附近","五成修理厂 地址：长沙市雨花区劳动东路160号附近","宏源达汽车修理厂 地址：长沙市岳麓区枫林二路545附近"]);
dsy.add("0_2_1", ["金航宇汽车修理厂 地址：张家界市永定区大庸路附近","国信誉汽车修理厂 地址：张家界市永定区天门路附近"]);
dsy.add("0_2_2", ["秦和祥汽车修理厂 地址：常德市安乡县深柳大道路口附近","荣盛华汽车修理厂 地址：常德市武陵区洞庭大道西段68号","天宇汽车配件修理厂 地址：常德市临澧县灵泉路附近"]);
dsy.add("0_2_3", ["小贝汽车修理厂  地址：岳阳市临湘市明源北路和湘北西路的交叉口附近","腾龙汽车修理厂   地址：岳阳市临湘市湘北中路附近"]);
dsy.add("0_2_4", ["前程汽车修理厂   地址：株洲市天元区秦淮路附近","株洲诚鑫汽车修理厂  地址：株洲市石峰区白石港","宇辉煌汽车修理厂地址：株洲市荷塘区大坪路加油站附近"]);
dsy.add("0_2_5", ["新通达修理厂   地址：衡阳市耒阳市德泰隆路附近","毅达汽车修理厂   地址：衡阳市蒸湘区紫云北街","环宇汽车修理厂	地址：衡阳市衡山县麋城路附近","雷云飞汽车修理厂 地址：衡阳市蒸湘区船山大道第1栋附近"]);
dsy.add("0_2_6", ["鸿洋汽车修理厂	地址：永州市冷水滩区河东翠园商贸街"]);
dsy.add("0_2_7", ["益欣修理厂   地址：邵阳市城步苗族自治县219省道和南山大道的交叉口附近","平安汽车修理厂  地址：邵阳市隆回县澄水路和辰河路的交叉口附近"]);
dsy.add("0_2", ["长沙市", "张家界市", "常德市", "岳阳市", "株洲市", "衡阳市", "永州市", "邵阳市"]);

dsy.add("0_3_0", ["南非汽车修理厂 地址：广州市荔湾区芳村大道东"]);
dsy.add("0_3_1", ["吉祥汽车修理厂  地址：深圳市宝安区龙华新区大浪街道宝安龙华大浪南路","隆发宏盛汽车修理厂 地址：深圳市福田区梅村路","天顺集汽车修理厂地址：深圳市罗湖区布心路"]);
dsy.add("0_3_2", ["小廖修理厂 地址：韶关市翁源县龙仙镇龙翔大道","好友汽车修理厂  地址：韶关市浈江区韶南大道北109号附近","飞腾鹏达汽车修理厂 地址：韶关市浈江区南郊","乾锋真汽车修理厂 地址：韶关市乐昌市坪乳公路"]);
dsy.add("0_3_3", ["时光汽车修理厂  地址：东莞市东莞市万高路附近","灿盛汽车修理厂  地址：东莞市东莞市东兴中路附近","鸿莱缘汽车修理厂地址：东莞市东莞市石碣镇"]);
dsy.add("0_3_4", ["志远强大汽车修理厂 地址：佛山市南海区盐步桂澜路","福兴高照汽车修理厂 地址：佛山市南海区官窑瑶平路"]);
dsy.add("0_3_5", ["华安汽车修理厂 地址：茂名市茂南区新福一路南一巷附近"]);
dsy.add("0_3", ["广州市", "深圳市", "韶关市", "东莞市", "佛山市", "茂名市"]);

dsy.add("0_4_0", ["西安橫行汽车修理厂 地址：西安市未央区明光路","盛昌汽车修理厂  地址：西安市雁塔区红专南路附近","永恒汽车修理厂   地址： 西安市未央区建章路南段附近","海纳百川小汽车修理厂  地址：西安市未央区朱宏路","鸿运达豪华汽车修理厂 地址：西安市雁塔区咸宁东路469号"]);
dsy.add("0_4_1", ["好伙伴修理厂   地址：延安市洛川县304省道附近","乐平汽车修理厂  地址：延安市洛川县交口河镇"]);
dsy.add("0_4_2", ["小平汽车修理厂  地址：铜川市印台区重兴南路和三里洞路的交叉口附近","山川修理厂  地址：铜川市王益区210国道附近"]);
dsy.add("0_4_3", ["富康汽车修理厂   地址：渭南市富平县车站大街附近","安乐汽车装潢修理厂   地址：渭南市富平县莲湖大街中段","三友汽车修理厂	地址：渭南市富平县车站大街东段西路","恒源发轿车修理厂 地址：渭南市韩城市乔南西路和巍山北路的交叉口附近"]);
dsy.add("0_4_4", ["韩申汽车修理厂	地址：汉中市留坝县紫柏路156号"]);
dsy.add("0_4_5", ["庚源申汽车修理厂 地址：榆林市绥德县滨河大道附近"]);
dsy.add("0_4_6", ["广发宏盛汽车修理厂 地址：安康市汉滨区高井村高井路"]);
dsy.add("0_4", ["西安市", "延安市", "铜川市", "渭南市",  "汉中市", "榆林市", "安康市"]);
dsy.add("0", ["福建省", "江西省","湖南省", "广东省","陕西省"]);

var s = ["s1", "s2", "s3"];
var opt0 = ["省份", "地级市", "市、县级市、县"];
function setup() {
    for (i = 0; i < s.length - 1; i++)
        document.getElementById(s[i]).onchange = new Function("change(" + (i + 1) + ");promptinfo();");
    change(0);
}
